{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "embedding_size": 768,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Infrastructure_Road_Condition",
    "1": "Waste_Management_Concern",
    "2": "Land_Allotment_Query",
    "3": "Infrastructure_Water_Supply_Issue",
    "4": "Infrastructure_Power_Outage"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Infrastructure_Power_Outage": 4,
    "Infrastructure_Road_Condition": 0,
    "Infrastructure_Water_Supply_Issue": 3,
    "Land_Allotment_Query": 2,
    "Waste_Management_Concern": 1
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.52.4",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 197285
}
